First/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ТипКлиента</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

First/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

First/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
</mdclass:Catalog>

First/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Доступность поля КПП при чтении
	Если ТекущийОбъект.ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Элементы.КПП.Доступность = Ложь;
	КонецЕсли;
	
	// Заполняем невидимый реквизит булево для решение по автоматическому изменению Полного наименования
	// Проверяем, что ПолноеНаименование пусто, если пусто, то ставим флаг "ПроверкаНаИзменениеПолногоНаименования = Истина"
	// То есть мы понимаем, что ПолноеНаименование не заполнялось и мы его можем редактировать
	Если СтрДлина(ТекущийОбъект.ПолноеНаименование) = 0 Тогда
 		  ПроверкаНаИзменениеПолногоНаименования = Истина;
	Иначе ПроверкаНаИзменениеПолногоНаименования = Ложь;
	КонецЕсли;
	  
КонецПроцедуры

&НаКлиенте
Процедура ТипКлиентаПриИзменении(Элемент)
	// Доступность поля КПП при изменении
	Если Объект.ТипКлиента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Элементы.КПП.Доступность = Истина;
	ИначеЕсли Объект.ТипКлиента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	// Расшифровка сокращении ОПФ
	// Здесь мы проверяем, что флаг "ПроверкаНаИзменениеПолногоНаименования = Истина"
	// Значит ПолноеНаименование не редактировалось и мы можем при изменении Наименования вносить свои корректировки
	Если ПроверкаНаИзменениеПолногоНаименования = Истина Тогда
	 	НаименованиеДлина = СтрДлина(Объект.Наименование);
		Если СтрНайти(Объект.Наименование, "АО ") > 0 Тогда
			Объект.ПолноеНаименование = "Акционерное общество" + Сред(Объект.Наименование, 3, НаименованиеДлина-1);
		ИначеЕсли СтрНайти(Объект.Наименование, "ООО ") > 0 Тогда
			Объект.ПолноеНаименование = "Общество с ограниченной ответственностью" + Сред(Объект.Наименование, 4, НаименованиеДлина-2);
		ИначеЕсли СтрНайти(Объект.Наименование, "ЗАО ") > 0 Тогда
			Объект.ПолноеНаименование = "Закрытое акционерное общество" + Сред(Объект.Наименование, 4, НаименованиеДлина-2);
		ИначеЕсли СтрНайти(Объект.Наименование, "ОАО ") > 0 Тогда
			Объект.ПолноеНаименование = "Открытое акционерное общество" + Сред(Объект.Наименование, 4, НаименованиеДлина-2);
		ИначеЕсли СтрНайти(Объект.Наименование, "ХО ") > 0 Тогда
			Объект.ПолноеНаименование = "Хозяйственное общество" + Сред(Объект.Наименование, 3, НаименованиеДлина-1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполняем невидимый реквизит булево для решение по автоматическому изменению Полного наименования
	// Проверяем, что ПолноеНаименование пусто, если пусто, то ставим флаг "ПроверкаНаИзменениеПолногоНаименования = Истина"
	// То есть мы понимаем, что ПолноеНаименование не заполнялось и мы его можем редактировать
	Если СтрДлина(Объект.ПолноеНаименование) = 0 Тогда
 		  ПроверкаНаИзменениеПолногоНаименования = Истина;
	Иначе ПроверкаНаИзменениеПолногоНаименования = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СписокКонтактныхЛицНаСервере()
	
	Выборка = Справочники.КонтактныеЛица.Выбрать(,Объект.Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
		Текст = СтрШаблон("%1. Должность: %2. Телефон: %3", Выборка.Наименование, Выборка.Должность, Выборка.Телефон);
		Сообщить(Текст);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтактныхЛиц(Команда)
	СписокКонтактныхЛицНаСервере();
КонецПроцедуры
